app/views/comments/_comment.html.erb

		<p class="comment_body"><%= comment.body %></p>
		<p class="comment_time"><%= time_ago_in_words(comment.created_at) %> Ago</p>
---
INSERT INTO `comments` (`body`, `created_at`, `name`, `post_id`, `recent`, `updated_at`) VALUES ('wwwwww', '2016-07-17 12:17:02', 'aqqqqq', 3, 1, '2016-07-17 12:17:02')