app/views/posts/index.html.erb

	</div>
		Tags: <%= raw post.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ') %>
---
SELECT  `tags`.* FROM `tags`  WHERE `tags`.`name` = 'aaaa' LIMIT 1