app/controllers/articles_controller.rb

SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`article_id` = 1
---
	def index
		if params[:tag]
			@articles = Article.tagged_with(params[:tag])
		else
			@articles = Article.includes(:comments).where(['comments.recent = ?', true]).references(:comment)

INSERT INTO `articles` (`body`, `created_at`, `title`, `updated_at`) VALUES ('az', '2016-07-17 04:31:19', 'azaaa', '2016-07-17 04:31:19')
---
	def create
		@article = Article.new(article_params)

		if @article.save