app/controllers/comments_controller.rb

	def create
		if params[:post_id]
			@post = Post.find(params[:post_id])
			Comment.limit_recent_comment_by_post @post.id
			@comment = @post.comments.create(params[:comment].permit(:name, :body))
			respond_to do |format|
      			format.html { redirect_to post_path(@post)}
      			format.js
    		end
		elsif params[:article_id]
			@article = Article.find(params[:article_id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "created_at", "name", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "aa"], ["created_at", "2016-07-13 16:05:07.652670"], ["name", "aaa"], ["post_id", 1], ["updated_at", "2016-07-13 16:05:07.652670"]]
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 1 LIMIT 1