app/controllers/posts_controller.rb

	def index
		if params[:tag]
			@posts = Post.tagged_with(params[:tag])
			@articles = Article.tagged_with(params[:tag])
			render 'tags/index'

		else
			@posts = Post.includes(:comments).where(['comments.recent = ?', true]).references(:comment)
---
SELECT `comments`.* FROM `comments` INNER JOIN (SELECT id, RANK() OVER(PARTITION BY post_id ORDER BY id DESC) rank FROM comments) rankings ON rankings.id = comments.id WHERE `comments`.`post_id` = 1 AND (rankings.rank < 3)
SELECT `posts`.* FROM `posts` INNER JOIN `taggings` ON `posts`.`id` = `taggings`.`post_id` WHERE `taggings`.`tag_id` = 1
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`post_id` = 1

	def create
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "aaaaaaa"], ["created_at", "2016-07-13 16:05:03.561916"], ["title", "aaaaaa"], ["updated_at", "2016-07-13 16:05:03.561916"]]

	def update
		@post = Post.find(params[:id])

		if @post.update(params[:post].permit(:title, :body,:tag_list))
---
SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `body` = 'aaaaaaac', `updated_at` = '2016-07-17 13:17:27' WHERE `posts`.`id` = 5

	def destroy
		@post = Post.find(params[:id])
		@post.destroy
---
SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 5 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 5